/** 東海道と中山道の共通区間のスポット一覧 */
const kusatsuToSanjyoSpots = [
  {
    name: "追分道標",
    kana: "おいわけみちしるべ",
    coordinate: [35.018102, 135.960927],
    icon: "monument",
    description:
      "「左 中仙道美のぢ」「右東海道いせみち」と彫られた道標があり、その上部に常夜燈の火袋があります。" +
      "文化13年 (1816) に建てられ、火袋の部分は何度も取り替えられたものの、道標部分は当時のものが残っているそうです。" +
      "近くには草津町道路元標もあります。",
    url: "https://kanko-kusatsu.com/spot/oiwakemitishirube",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_032818617.webp",
        comment: "追分道標",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_032805097.webp",
        comment: "説明板",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_024827690.webp",
        comment: "草津町道路元標",
      },
    ],
  },
  {
    name: "草津宿高札場跡",
    kana: "くさつしゅくこうさつばあと",
    coordinate: [35.018174, 135.960835],
    icon: "kosatsuba",
    description: "草津川ずい道の入口に高札場が再現されています。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_032922664.webp",
        comment: "高札場",
      },
    ],
  },
  {
    name: "草津宿本陣 (田中七左衛門本陣)",
    kana: "くさつじゅくほんじん (たなかしちざえもんほんじん) ",
    coordinate: [35.0177048, 135.9603757],
    icon: "honjin",
    description:
      "草津宿に2軒あった本陣のうちの1軒で、建物が現存する本陣としては最大級です。国指定史跡になっています。" +
      "見学することができ、畳廊下、上段の間、庭園、住居部、台所など敷地内を隅々まで見て回れます。",
    url: "https://www.city.kusatsu.shiga.jp/kusatsujuku/honjin/",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_033139192.webp",
        comment: "草津宿田中七左衛門本陣",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_033412676.webp",
        comment: "畳廊下",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_034112258.webp",
        comment: "庭園",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_034056403.webp",
        comment: "明治天皇草津行在所碑",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_033613438.webp",
        comment: "上段雪隠",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_034156964.webp",
        comment: "湯殿",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_034758830.webp",
        comment: "かまど",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_035511931.webp",
        comment: "井戸",
      },
    ],
  },
  {
    name: "草津宿本陣 (田中九蔵本陣)",
    kana: "くさつじゅくほんじん (たなかくぞうほんじん)",
    coordinate: [35.016931, 135.959905],
    icon: "honjin",
    description:
      "草津宿のもう1つの本陣跡は、明治10年 (1877) に知新學校 (草津小学校の前身) が建てられたことで現存していないとのことです。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_040244943.webp",
        comment: "草津宿田中九蔵本陣",
      },
    ],
  },
  {
    name: "草津宿街道交流館",
    kana: "くさつじゅくかいどうこうりゅうかん",
    coordinate: [35.015773, 135.958972],
    icon: "building",
    description:
      "草津宿に関する様々な史料や解説、版画づくりなどの体験ができます。" +
      "本陣とセットで見学できる共通券がおすすめです。",
    url: "https://www.city.kusatsu.shiga.jp/kusatsujuku/koryukan/",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_044356003.webp",
        comment: "草津宿田中九蔵本陣",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_044648089.webp",
        comment: "版画体験コーナー",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_045340833.webp",
        comment: "草津宿模型",
      },
    ],
  },
  {
    name: "草津宿黒門跡",
    kana: "くさつじゅくくろもんあと",
    coordinate: [35.011798, 135.956655],
    icon: "monument",
    description:
      "現在の草津川に架かる矢倉橋に黒門跡の説明板があります。" +
      "草津宿の京方の入口で、文化14年 (1817) に黒門が設置されていたそうです。" +
      "元々は宮川橋にあったが、石垣が崩れたことから八倉村境のここに移したとも記されています。" +
      "黒門跡の説明板の隣には名物立場の絵があります。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_030641825.webp",
        comment: "草津宿黒門跡",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_030638939.webp",
        comment: "名物立場",
      },
    ],
  },
  {
    name: "野路一里塚跡",
    kana: "のじいちりづかあと",
    coordinate: [35.003226, 135.951981],
    icon: "ichirizuka",
    description:
      "日本橋から東海道経由で119里 (約467.3km) の一里塚跡で、" +
      "野路上北池公園内に石碑や説明板、モニュメント的な土盛りがあります。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_052717032.webp",
        comment: "説明板",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_052731604.webp",
        comment: "石碑",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_052831221.webp",
        comment: "野路上北池公園",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_040745271.webp",
        comment: "説明板",
      },
    ],
  },
  {
    name: "清宗塚",
    kana: "きよむねづか",
    coordinate: [35.001729, 135.952114],
    icon: "monument",
    description:
      "壇ノ浦で父宗盛と共に生虜となり斬首された清宗の胴塚があるそうです。" +
      "中山道沿いの野洲市篠原にも親子の胴塚があり (平家終焉の地)、それと矛盾しているようにも思いますが、" +
      "本当のところは分かりません。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_041154013.webp",
        comment: "説明板",
      },
    ],
  },
  {
    name: "野路萩の玉川",
    kana: "のじはぎのたまがわ",
    coordinate: [34.997406, 135.947885],
    icon: "monument",
    description:
      "萩の玉川と彫られた石碑が小さな池の奥にあります。" +
      "景勝地として多くの貴族や詩人などが訪れ歌を詠んだそうです。" +
      "また中世の頃には野路駅が置かれ宿場として栄えていたそうです。",
    url: "http://noji-city.com/publics/index/40/",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_054143803.webp",
        comment: "野路萩の玉川",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_043709994.webp",
        comment: "野路萩の玉川",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_054158798.webp",
        comment: "説明板",
      },
    ],
  },
  {
    name: "浄財辯財天神社",
    kana: "じょうざいべんざいてんじんじゃ",
    coordinate: [34.995114, 135.94443],
    icon: "shrine",
    description:
      "弁天池という大きな池があり、その中に弁財天の鎮座する小島があります。" +
      "弁財天へは細いコンクリートの橋を通ってお参りできます。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_054830151.webp",
        comment: "弁天池",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_054930325.webp",
        comment: "参道",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_055059126.webp",
        comment: "社殿",
      },
    ],
  },
  {
    name: "明治天皇御東遷御駐輦之所",
    kana: "めいじてんのうごとうせんごちゅうれんのところ",
    coordinate: [34.986665, 135.935702],
    icon: "monument",
    description:
      "月輪寺という曹洞宗のお寺の参道に明治天皇御東遷御駐輦之所と彫られた石碑があります。" +
      "御東遷、つまり東京巡幸の際の休憩所ということになります。" +
      "東京巡幸の聖蹟は東海道にしかないので、京を目指す中山道69次ウォーカーにとっては新鮮なものです。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_062437767.webp",
        comment: "明治天皇御東遷御駐輦之所",
      },
    ],
  },
  {
    name: "立場跡",
    kana: "たてばあと",
    coordinate: [34.986649, 135.934539],
    icon: "monument",
    description:
      "月輪池の縁に立場跡の石碑があります。かつてこの地に立場茶屋があったことを示しているようです。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_050603972.MP.webp",
        comment: "東海道立場跡",
      },
    ],
  },
  {
    name: "大萱一里塚跡",
    kana: "おおがやいちりづかあと",
    coordinate: [34.983505, 135.928242],
    icon: "ichirizuka",
    description:
      "日本橋から東海道経由で120里 (約471.3km) の一里塚跡で、大きな石碑と説明板があります。" +
      "説明板によると、塚は明治末期に消失してしまったそうです。" +
      "月輪池 (つきのわいけ) 一里塚跡とも呼ばれています。" +
      "交差点の対面には旧朝倉道などを記した巨大な道標があります。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_063736835.webp",
        comment: "大萱一里塚跡",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_052331532.webp",
        comment: "説明板",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_052416319.webp",
        comment: "道標",
      },
    ],
  },
  {
    name: "大江の千里 (ちりんさん)",
    kana: "おおえのちさと",
    coordinate: [34.980998904370146, 135.92479425449676],
    icon: "monument",
    description: "平安時代前期の歌人の奥方がこの地に住んでいたとのことです。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_053040827.webp",
        comment: "説明板",
      },
    ],
  },
  {
    name: "大場の桜",
    coordinate: [34.976674, 135.917854],
    icon: "camera",
    description:
      "大きな桜の木があり、江戸時代からある古木とのことです。" +
      "説明板には東海道と芦浦街道との分岐点の近くであることも記されています。" +
      "芦浦街道は芦浦観音寺への参詣道で、ここから少し西にある交差点から北に分岐しています。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_054500977.webp",
        comment: "説明板",
      },
    ],
  },
  {
    name: "瀬田の唐橋",
    kana: "せたのからはし",
    coordinate: [34.972948, 135.906685],
    icon: "bridge",
    description:
      "かつては瀬田川にかかる唯一の橋で、琵琶湖周辺を陸路で移動する際の最重要拠点でした。" +
      "現在の橋は昭和54年 (1979) に架けられたもので比較的新しいですが、" +
      "擬宝珠 (ぎぼし) や緩やかなアーチなどの特徴が引き継がれています。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_061101036.MP.webp",
        comment: "瀬田唐橋",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_061828677.webp",
        comment: "西側",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_061252247.webp",
        comment: "擬宝珠",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_073332989.webp",
        comment: "琵琶湖方面",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_061535098.webp",
        comment: "石碑",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_061548858.MP.webp",
        comment: "説明板",
      },
    ],
  },
  {
    name: "膳所城勢多口総門跡",
    kana: "ぜぜじょうせたぐちそうもんあと",
    coordinate: [34.987261, 135.897413],
    icon: "monument",
    description:
      "膳所城の南総門があった場所で、石碑があります。" +
      "Wikipedia によると、貞享4年 (1687) に建てられた高麗門で、廃城後に建部大社に移築、その後個人所有を経て" +
      "今はなんとアメリカ西海岸のポートランド日本庭園にあるそうです。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_080224826.webp",
        comment: "膳所城勢多口総門跡",
      },
    ],
  },
  {
    name: "石坐神社",
    kana: "いわいじんじゃ",
    coordinate: [35.000414, 135.888057],
    icon: "shrine",
    description:
      "平安時代の延喜式に近江国滋賀郡八社の1つに数えられていたそうで、古くからあった神社であることがわかります。" +
      "本殿は鎌倉時代の文永3年 (1266) に建造された記録が残るそうです。" +
      "平安時代や鎌倉時代の神像4柱が国指定重要文化財になっています。",
    url: "http://www.iwaijinzya.org",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_084709009.webp",
        comment: "社殿",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_084528452.webp",
        comment: "鳥居",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_084719092.webp",
        comment: "エノキ",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_084553536.webp",
        comment: "由緒",
      },
    ],
  },
  {
    name: "膳所城北総門跡",
    kana: "ぜぜじょうきたそうもんあと",
    coordinate: [35.001935, 135.884779],
    icon: "monument",
    description:
      "道がジグザクになっているところの角に膳所城北総門跡の石碑があります。" +
      "古地図を見ると、ここはかつての琵琶湖の湖畔ギリギリの場所です。" +
      "ここに門があったということは、このジグザグ道も城郭を守るために人為的に設けた枡形だったのだろうと想像できます。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_085227551.webp",
        comment: "膳所城北総門跡",
      },
    ],
  },
  {
    name: "義仲寺",
    kana: "ぎちゅうじ",
    coordinate: [35.00316, 135.880266],
    icon: "temple",
    description:
      "木曽義仲 (源義仲) の塚と松尾芭蕉の墓があることで有名なお寺で、国指定史跡になっています。" +
      "巴御前を祀ったといわれる巴地蔵堂もあります。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_085844218.webp",
        comment: "義仲寺",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-04/PXL_20240504_085823185.webp",
        comment: "説明板",
      },
    ],
  },
  {
    name: "迂回",
    coordinate: [35.0047391, 135.8717877],
    icon: "guide",
    description: "横断歩道がないため、付近の交差点に迂回してください。",
  },
  {
    name: "天孫神社",
    kana: "てんそんじんじゃ",
    coordinate: [35.005685, 135.867273],
    icon: "shrine",
    description:
      "盛大な曳山巡行で有名な大津祭を催している神社で、創建は延暦年間 (782-806) だそうです。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240504_221734424.webp",
        comment: "拝殿",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240504_221925822.webp",
        comment: "鳥居",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240504_221711085.webp",
        comment: "裏門",
      },
    ],
  },
  {
    name: "大津魚忠",
    kana: "おおつうおちゅう",
    coordinate: [35.00666, 135.865845],
    icon: "building",
    description:
      "明治38年に建てられた商家で、国登録有形文化財になてちます。" +
      "高級料亭として営業中で、ランチもやっていますが要予約です。",
    url: "https://www.uochuu.jp",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240504_222311788.webp",
        comment: "大津魚忠",
      },
    ],
  },
  {
    name: "此付近露国皇太子遭難之地",
    kana: "このふきんろこくこうたいしそうなんのち",
    coordinate: [35.006983, 135.86483],
    icon: "monument",
    description:
      "此付近露国皇太子遭難之地と彫られた石碑があります。" +
      "明治24年 (1891) にロシアの皇太子が切り付けられて負傷した大津事件の現場がこのあたりであることを示しています。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_093827017.webp",
        comment: "此付近露国皇太子遭難之地",
      },
    ],
  },
  {
    name: "大津宿大塚嘉右衛門本陣跡",
    kana: "おおつじゅくおおつかかえもんほんじんあと",
    coordinate: [35.005952, 135.861515],
    icon: "honjin",
    description:
      "大津宿にあった2つの本陣のうちの1つです。" +
      "明治天皇聖跡と書かれた大きな石碑があるほか、石碑に標柱に車石に説明板にとにぎやかです。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240504_223402104.webp",
        comment: "大津宿本陣跡 石碑",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240504_223444280.webp",
        comment: "明治天皇聖跡碑",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240504_223417046.webp",
        comment: "大津宿本陣跡 説明板",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240504_223421159.webp",
        comment: "車石 説明板",
      },
    ],
  },
  {
    name: "大津宿肥前屋九左衛門本陣跡",
    kana: "おおつじゅくひぜんやくざえもんほんじんあと",
    coordinate: [35.00516, 135.861235],
    icon: "honjin",
    description: "大津宿のもう1つの本陣、肥前屋九左衛門本陣跡は観光案内板があるのみです。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-17/PXL_20230716_212759634.webp",
        comment: "大津宿肥前屋九左衛門本陣跡",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240504_223628954.webp",
        comment: "説明板 (内容は大塚嘉右衛門本陣)",
      },
    ],
  },
  {
    name: "逢坂山関址",
    kana: "あいさかやませきあと",
    coordinate: [34.994225, 135.855593],
    icon: "sekisho",
    description:
      "逢坂の頂上に逢坂山関址と彫られた石碑と常夜燈があります。" +
      "説明板によると、平安時代には不破、鈴鹿と並ぶ三関のひとつであったそうですが、" +
      "正確な位置はわかっていないようです。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-17/PXL_20230716_215120663.webp",
        comment: "逢坂山関址",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240504_230100720.webp",
        comment: "説明板",
      },
    ],
  },
  {
    name: "大津絵販売之地",
    kana: "おおつえはんばいのち",
    coordinate: [34.994273, 135.855165],
    icon: "monument",
    description:
      "平成25年 (2013) の大津絵販売之地と彫られた石碑があります。" +
      "大津絵はこの地が発祥の仏画・世俗画で、旅人の土産物として人気だったそうです。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-17/PXL_20230716_215205964.webp",
        comment: "大津絵販売之地",
      },
    ],
  },
  {
    name: "蝉丸神社",
    kana: "せみまるじんじゃ",
    coordinate: [34.994696, 135.854045],
    icon: "shrine",
    description:
      "平安時代の琵琶法師である蝉丸を祀る神社で、創祀は天慶9年 (946)、現在の社殿は萬治3年 (1660) のものだそうです。" +
      "関蝉丸神社の分社で、関蝉丸神社の上社は逢坂の途中、下社は逢坂の入口にあります。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240504_230644867.webp",
        comment: "本殿",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240504_230500597.webp",
        comment: "参道",
      },
    ],
  },
  {
    name: "大津算盤の始祖・片岡庄兵衛",
    kana: "おおつそろばんのしそ・かたおかしょうべえ",
    coordinate: [34.992327, 135.849555],
    icon: "monument",
    description:
      "「大津算盤の始祖・片岡庄兵衛」と刻まれた説明板が付いた石碑があります。" +
      "明国から長崎に渡来した算盤を参考にして慶長17年 (1612) に製造を始めたそうです。" +
      "石碑の裏には荷車の車輪と、荷車用の敷石として使われた車石が置かれています。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-17/PXL_20230716_220251376.webp",
        comment: "大津算盤の始祖・片岡庄兵衛の碑",
      },
    ],
  },
  {
    name: "走井一里塚跡",
    kana: "はしりいいちりづかあと",
    coordinate: [34.992055, 135.848987],
    icon: "ichirizuka",
    description:
      "日本橋から東海道経由で123里 (約483.1km) の一里塚跡で、" +
      "「右一里丁 左大谷町」とだけ彫られた石碑があります。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-17/PXL_20230716_220342519.webp",
        comment: "右一里丁 左大谷町",
      },
    ],
  },
  {
    name: "髭茶屋追分",
    kana: "ひげちゃやおいわけ",
    coordinate: [34.990985, 135.836363],
    icon: "monument",
    description:
      "東海道は右手方向で、左手は伏見を経由して奈良方面や大阪 (大坂) 方面に向かう奈良・京街道です。" +
      "東海道53次と東海道57次の分かれ道でもあります。" +
      "大津歴博のウェブサイトによると、置かれている道標は復元したもので、" +
      "「みぎハ京ミチ」「ひだりハふしミミち」と彫られているそうです。",
    url: "https://www.rekihaku.otsu.shiga.jp/db/jiten/data/102.html",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-17/PXL_20230716_222359941.webp",
        comment: "髭茶屋追分",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-17/PXL_20230716_222414468.webp",
        comment: "道標",
      },
    ],
  },
  {
    name: "車石・車道",
    kana: "くるまいし・くるまみち",
    coordinate: [34.991165, 135.835478],
    icon: "monument",
    description:
      "閑栖寺の説明板があり、文化2年 (1805) に牛舎の通行を楽にするために歩車分離工事が行われ、" +
      "この付近は京に向かって右側が車石の敷かれた車道、西側が人馬道になったそうです。" +
      "花崗岩の厚板石でできた車石も展示されています。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-17/PXL_20230716_222551723.webp",
        comment: "車石説明板",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-17/PXL_20230716_222604514.webp",
        comment: "閑栖寺",
      },
    ],
  },
  {
    name: "明治天皇御遺跡",
    kana: "めいじてんのうごいせき",
    coordinate: [34.99127, 135.816818],
    icon: "monument",
    description:
      "かつて奴茶屋という戦国自体からの茶店があり、明治天皇も御東幸の際を含め3回立ち寄ったそうです。" +
      "石碑と説明板があるほか、山科駅前にある旧東海道の説明板でも紹介されています。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240505_001200910.MP.webp",
        comment: "明治天皇御遺跡 石碑",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240505_001205360.MP.webp",
        comment: "明治天皇御遺跡 説明板",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-17/PXL_20230716_230435484.MP.webp",
        comment: "旧東海道 説明板",
      },
    ],
  },
  {
    name: "五条別れ道標",
    kana: "ごじょうわかれみちしるべ",
    coordinate: [34.991173, 135.811462],
    icon: "monument",
    description:
      "宝永4年 (1707) の道標で「右ハ 三条通」「左ハ 五条橋 ひがしにし六条大佛 今ぐまきよみず 道」と彫られています。" +
      "「ひがしにし六条」は六条沿いにある東本願寺と西本願寺、「大佛」は現存しない方広寺の大仏、" +
      "「今ぐま」は今熊野観音寺、「きよみず」は清水寺をそれぞれ指していると考えられます。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240505_001852754.MP.webp",
        comment: "五条別れ道標",
      },
    ],
  },
  {
    name: "亀の水不動尊",
    kana: "かめのみずふどうそん",
    coordinate: [34.99495, 135.798396],
    icon: "monument",
    description:
      "ここより少し坂を上ったところにある「日ノ岡の峠道」の説明板によると、" +
      "木食正禅上人 (もくじきしょうぜんしょうにん) が享保19年 (1734) 頃から道路の改修に取り組み、" +
      "峠道の維持管理をする「梅香庵」を建て、井戸を掘って亀の口から水を落として量救水 (りょうぐすい) と" +
      "名付けて旅人や牛馬に提供したり、湯茶の接待をしたりしたとあります。" +
      "この不動尊は木食正禅の貢献を今に伝えているようです。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240505_004636626.webp",
        comment: "亀の水不動尊 参道",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240505_004606831.webp",
        comment: "入口",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-17/PXL_20230716_234501501.webp",
        comment: "日ノ岡の峠道 説明板",
      },
    ],
  },
  {
    name: "車石広場",
    kana: "くるまいしひろば",
    coordinate: [34.999771, 135.793241],
    icon: "monument",
    description:
      "平成9年 (1997) の地下鉄東西線の開業に伴い使わなくなった京津線の軌道跡を活用して道路整備を行ったそうです。" +
      "この広場はその記念に作られたもので、牛車の荷車のオブジェや車石などが展示されています。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-17/PXL_20230716_234833056.MP.webp",
        comment: "車石広場",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-17/PXL_20230716_234853501.webp",
        comment: "三条通整備事業記念碑",
      },
    ],
  },
  {
    name: "日ノ岡峠",
    kana: "ひのおかとうげ",
    coordinate: [35.002131, 135.792078],
    icon: "pass",
    description:
      "標高 90m〜100m 程の峠で、九条山とも呼ばれています。" +
      "粟田口刑場跡の説明板があり、古来からの公開処刑場だったそうです。" +
      "江戸時代には磔、獄門、火刑が行われ、明治5年 (1872) には解剖所も設けられたとのことです。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240505_011202089.MP.webp",
        comment: "粟田口刑場跡",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240505_011146051.webp",
        comment: "九条山交差点",
      },
    ],
  },
  {
    name: "ねじりまんぽ",
    coordinate: [35.008582, 135.790091],
    icon: "monument",
    description:
      "蹴上インクラインの下を通る歩行者用トンネルで、ねじれるようにレンガが積まれているのが特徴です。" +
      "「まんぽ」はトンネルを意味する古い言葉だそうです。" +
      "西側の歩道からアクセスする場合は蹴上駅の出入口を経由するのが便利です。",
    url: "https://biwakososui.kyoto.travel/midokoro/212",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240505_020427326.webp",
        comment: "ねじりまんぽ 東側",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240505_012706007.webp",
        comment: "ねじりまんぽ 西側",
      },
    ],
  },
  {
    name: "蹴上インクライン・蹴上船溜",
    kana: "けあげいんくらいん・けあげふなだまり",
    coordinate: [35.007435, 135.791054],
    icon: "monument",
    description:
      "琵琶湖疏水の船をケーブルカーで上げ下げしていた場所で、2025年に南禅寺水路閣などと共に国宝に指定されました。" +
      "街道筋からはねじりまんぽを経由してアクセスするのが便利です。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240505_012949845.webp",
        comment: "蹴上インクライン",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240505_013454062.webp",
        comment: "蹴上インクライン",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240505_013438913.webp",
        comment: "蹴上船溜",
      },
    ],
  },
  {
    name: "南禅寺水路閣",
    kana: "なんぜんじすいろかく",
    coordinate: [35.010583, 135.793945],
    icon: "bridge",
    description:
      "レンガで造られた水路橋で、2025年にインクラインなどと共に国宝に指定されました。" +
      "琵琶湖疏水から分水した水を水力発電所に送るために建設されましたが、" +
      "現在は上水道として利用されているそうです。",
    url: "https://nanzenji.or.jp/equipment/sosui",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240505_014914937.webp",
        comment: "南禅寺水路閣",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240505_014820823.webp",
        comment: "水路閣橋脚",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240505_014608537.webp",
        comment: "水路閣上部",
      },
    ],
  },
  {
    name: "南禅寺",
    kana: "",
    coordinate: [35.01126, 135.793637],
    icon: "temple",
    description:
      "臨済宗南禅寺派の大本山で、方丈や古文書、境内の隅にある水路閣が国宝に指定されているほか、" +
      "三門や勅使門など多数の重要文化財があります。",
    url: "https://nanzenji.or.jp",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240505_015445413.webp",
        comment: "法堂",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240505_015827383.webp",
        comment: "三門",
      },
    ],
  },
  {
    name: "三条大橋",
    kana: "さんじょうおおはし",
    coordinate: [35.009044, 135.771801],
    icon: "bridge",
    description:
      "鴨川に架かる橋で、東海道53次・中山道69次の西の起点です。" +
      "西詰の北側に高札場跡があり、説明板があります。" +
      "西詰の南側に東海道中膝栗毛の弥次郎兵衛と喜多八の像があります。" +
      "東詰の南側に御所の方角を向いて皇室の衰微を嘆く尊王家の武士の像と石碑 (高山彦九郎皇居望拝之趾) があります。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-17/PXL_20230717_003119146.webp",
        comment: "三条大橋",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-17/PXL_20230717_003017195.webp",
        comment: "鴨川下流方向",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-17/PXL_20230717_003155793.webp",
        comment: "高札場跡",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-17/PXL_20230717_003101657.MP.webp",
        comment: "東海道中膝栗毛の弥次喜多像",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-17/PXL_20240505_023234531.webp",
        comment: "高山彦九郎皇居望拝之趾",
      },
    ],
  },
  {
    name: "池田屋騒動之址",
    kana: "いけだやそうどうのあと",
    coordinate: [35.008935, 135.769864],
    icon: "monument",
    description: "池田屋事件の池田屋の跡地は居酒屋になっています。その名も「旅籠茶屋 池田屋」。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-17/PXL_20230717_003508985.webp",
        comment: "池田屋騒動之址・旅籠茶屋 池田屋",
      },
    ],
  },
  {
    name: "河原町三条",
    coordinate: [35.008774, 135.768993],
    icon: "camera",
    description:
      "三条通のここから西は商店街のアーケードになっています。" +
      "交差する河原町通は現在では祇園祭で山鉾が通過する大通りですが、これは昭和初期の工事によるもので、" +
      "山鉾も以前は寺町通を通っていたそうです。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-17/PXL_20230717_010921063.webp",
        comment: "1番目 長刀鉾 (なぎなたぼこ)",
      },
    ],
  },
  {
    name: "建礼門",
    kana: "けんれいもん",
    coordinate: [35.02323, 135.762116],
    icon: "monument",
    description:
      "京都御所の南に位置する門で、明治天皇が明治元年に東京に向けて出発された際の出発点です。" +
      "特別な時にだけ開かれ、特別な人しか通ることができませんが、間近で見ることはできます。",
    url: "https://kyoto-gosho.kunaicho.go.jp/gate/2C70",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240505_032308177.webp",
        comment: "建礼門",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2024/05-05/PXL_20240505_032025934.webp",
        comment: "遠景",
      },
    ],
  },
];

/** 東海道と中山道の共通区間のおすすめ歩行ルート */
const kusatsuToSanjyoRoute = [
  [35.0180167, 135.9607834], // 中山道・東海道合流地点
  [35.0175993, 135.9604079], // 68. 草津宿
  [35.0154554, 135.9586376],
  [35.0142208, 135.9575754],
  [35.0135178, 135.9571302],
  [35.0132279, 135.9570765],
  [35.0126435, 135.9567761],
  [35.0120899, 135.9566957],
  [35.0109607, 135.9560627],
  [35.0090539, 135.9548074],
  [35.0083509, 135.95433],
  [35.0065186, 135.9531873],
  [35.0057936, 135.9528065],
  [35.0046424, 135.9522808],
  [35.0040975, 135.9521359],
  [35.0040228, 135.9521949],
  [35.0037328, 135.9519804],
  [35.0036318, 135.9519857],
  [35.0033637, 135.9519321],
  [35.0033066, 135.9520179],
  [35.0031528, 135.9518784],
  [35.0032978, 135.9516263],
  [35.0031704, 135.9515029],
  [35.0029726, 135.9519535],
  [35.0027397, 135.9519482],
  [35.0020587, 135.9521466],
  [35.0015226, 135.9521198],
  [35.0010392, 135.9520018],
  [35.0005954, 135.9517336],
  [35.0001735, 135.9508485],
  [34.9997473, 135.9498668],
  [34.9994485, 135.949443],
  [34.9989827, 135.9490138],
  [34.9978445, 135.9481341],
  [34.9975194, 135.9479678],
  [34.996891, 135.9476191],
  [34.9962582, 135.9469968],
  [34.9957396, 135.9457576],
  [34.9958099, 135.9452266],
  [34.9957132, 135.9448564],
  [34.9947113, 135.9445775],
  [34.9935731, 135.9443575],
  [34.9934061, 135.9441966],
  [34.993182, 135.9441537],
  [34.9923953, 135.943467],
  [34.9916878, 135.9426302],
  [34.9909495, 135.942024],
  [34.9905627, 135.9415627],
  [34.9900266, 135.9411979],
  [34.9887916, 135.9398782],
  [34.9878643, 135.9385425],
  [34.9873501, 135.9378773],
  [34.986893, 135.9369171],
  [34.9866688, 135.9355652],
  [34.9867172, 135.934664],
  [34.9866996, 135.9339023],
  [34.9868666, 135.9331512],
  [34.9865194, 135.932411],
  [34.9856053, 135.931778],
  [34.9855261, 135.9314775],
  [34.9851482, 135.9301096],
  [34.9849812, 135.9295356],
  [34.9847658, 135.9293479],
  [34.9842384, 135.9289187],
  [34.983456, 135.9281194],
  [34.9832671, 135.9277332],
  [34.9830737, 135.9271216],
  [34.9829946, 135.9264296],
  [34.9828979, 135.9261453],
  [34.9822386, 135.9254211],
  [34.9818562, 135.9252065],
  [34.9810826, 135.9248257],
  [34.9808233, 135.9245253],
  [34.9807266, 135.9239835],
  [34.9807002, 135.9232646],
  [34.9807398, 135.9219611],
  [34.9806958, 135.9209472],
  [34.9807574, 135.9201157],
  [34.9797904, 135.9199977],
  [34.9795223, 135.9200513],
  [34.9782476, 135.9199709],
  [34.9779795, 135.9199709],
  [34.9772894, 135.9199494],
  [34.9767751, 135.9198421],
  [34.9767356, 135.919134],
  [34.9767268, 135.9177393],
  [34.9767927, 135.9166878],
  [34.9768279, 135.9160763],
  [34.9767048, 135.9156847],
  [34.9764587, 135.9151644],
  [34.976129, 135.9145635],
  [34.9761641, 135.9142631],
  [34.9763136, 135.9138662],
  [34.97554, 135.9130454],
  [34.9733861, 135.9109372],
  [34.9729026, 135.910905],
  [34.9728718, 135.9101915],
  [34.9727048, 135.907681],
  [34.9734081, 135.9048164], // 瀬田の唐橋
  [34.9738169, 135.903191],
  [34.9742213, 135.9019679],
  [34.974907, 135.9018981],
  [34.9766257, 135.9019464],
  [34.9774037, 135.9020376],
  [34.9783048, 135.9020269],
  [34.979219, 135.9020966],
  [34.9806563, 135.9019357],
  [34.9826166, 135.9011525],
  [34.983166, 135.9011579],
  [34.9842384, 135.9006858],
  [34.9843702, 135.9002513],
  [34.9845504, 135.8994466],
  [34.9849855, 135.8989048],
  [34.9852273, 135.8982182],
  [34.9854954, 135.897966],
  [34.9861371, 135.8977783],
  [34.9866205, 135.8977354],
  [34.9872446, 135.8973598],
  [34.9873325, 135.8964962],
  [34.9875303, 135.896244],
  [34.9872885, 135.894168],
  [34.9885543, 135.8940661],
  [34.9897848, 135.8939373],
  [34.9911296, 135.8939052],
  [34.9912571, 135.8937871],
  [34.9912879, 135.8919847],
  [34.9931995, 135.8919418],
  [34.9949794, 135.891915],
  [34.9975985, 135.8919203],
  [34.9985257, 135.8919472],
  [34.9996814, 135.8899516],
  [35.0004811, 135.8902788],
  [35.0007404, 135.889855],
  [35.0007624, 135.8895922],
  [35.000736, 135.8892596],
  [35.0005031, 135.8889377],
  [35.0003713, 135.8888626],
  [35.0006393, 135.8879507],
  [35.000881, 135.8869958],
  [35.0013073, 135.8859926],
  [35.0015445, 135.8852577],
  [35.0016412, 135.8848286],
  [35.0019312, 135.8847481],
  [35.0024058, 135.8831227],
  [35.0027441, 135.8819962],
  [35.0030517, 135.8807892],
  [35.003311, 135.8797485],
  [35.003434, 135.8790189],
  [35.0038734, 135.8776402],
  [35.0042513, 135.8764118],
  [35.0042513, 135.8760202],
  [35.0041854, 135.87565],
  [35.0041063, 135.8752048],
  [35.0041151, 135.8744913],
  [35.0041019, 135.8736277],
  [35.0047215, 135.8718306],
  [35.0043524, 135.8716804],
  [35.0044007, 135.8715409],
  [35.0047654, 135.8717394],
  [35.0056662, 135.8689982],
  [35.0064044, 135.866729],
  [35.0071469, 135.8645082],
  [35.007929, 135.8620405],
  [35.0064307, 135.8615631],
  [35.0059166, 135.8614075], // 69. 大津宿
  [35.0048709, 135.8610642],
  [35.0032583, 135.8601469],
  [35.0010831, 135.8587253],
  [35.0004811, 135.8585912],
  [34.9996155, 135.8581084],
  [34.9989915, 135.857926],
  [34.9976907, 135.8575237],
  [34.9970272, 135.8574164],
  [34.9953617, 135.8577543],
  [34.9948387, 135.8577007],
  [34.994452, 135.8574325],
  [34.9941576, 135.8570248],
  [34.9940653, 135.8564776],
  [34.994118, 135.8557212],
  [34.9941092, 135.8554584],
  [34.9942279, 135.8551097],
  [34.9944916, 135.8538705],
  [34.994496, 135.8532751],
  [34.9943773, 135.8526742],
  [34.9943377, 135.8525831],
  [34.9941444, 135.8526152],
  [34.9941048, 135.8524436],
  [34.993951, 135.8519715],
  [34.9934676, 135.8511883],
  [34.9924393, 135.8497131],
  [34.9918724, 135.8484578],
  [34.9910681, 135.8454645],
  [34.9902946, 135.8423156],
  [34.9901672, 135.8417094],
  [34.990176, 135.8411086],
  [34.9903606, 135.8402556],
  [34.9902375, 135.8398533],
  [34.9905495, 135.8387536],
  [34.9908, 135.8381689],
  [34.9909978, 135.8363879], // 髭茶屋追分
  [34.991156, 135.8353633],
  [34.9911428, 135.833534],
  [34.9911384, 135.8323914],
  [34.9911824, 135.8312702],
  [34.9912527, 135.8311844],
  [34.9916262, 135.8309644],
  [34.9915384, 135.8308464],
  [34.9912879, 135.8302349],
  [34.9914241, 135.828191],
  [34.9914065, 135.8274668],
  [34.9915164, 135.8262599],
  [34.991468, 135.8255088],
  [34.9912659, 135.8237547],
  [34.9913274, 135.82111],
  [34.9912966, 135.8193934],
  [34.9912263, 135.8188999],
  [34.9912351, 135.8173174],
  [34.991178, 135.8151233],
  [34.9912395, 135.813396],
  [34.9911956, 135.8116043],
  [34.991323, 135.8103758],
  [34.9916306, 135.8097911],
  [34.9918152, 135.8077741],
  [34.9935511, 135.8057839],
  [34.9935028, 135.8050221],
  [34.9935335, 135.8043462],
  [34.9938763, 135.8029407],
  [34.994285, 135.8006823],
  [34.994496, 135.799647],
  [34.9947377, 135.7988745],
  [34.995098, 135.798322],
  [34.9957352, 135.7980269],
  [34.9962362, 135.7972813],
  [34.9966053, 135.7971096],
  [34.9971327, 135.7966],
  [34.9976556, 135.7959831],
  [34.998306, 135.7948726],
  [34.9987014, 135.7940143],
  [34.9992244, 135.7935208],
  [34.9996638, 135.7933706],
  [35.0005295, 135.7932365],
  [35.0015533, 135.7924908],
  [35.0030298, 135.7916594],
  [35.0037811, 135.7908601],
  [35.0042996, 135.7907099],
  [35.0054728, 135.7910371],
  [35.0060089, 135.7908922],
  [35.0072919, 135.7902539],
  [35.0084168, 135.7899535],
  [35.0091461, 135.7891595],
  [35.0093219, 135.7879579],
  [35.0095152, 135.7855546],
  [35.0092252, 135.782454],
  [35.009502, 135.7789564],
  [35.009379, 135.7753837],
  [35.0091066, 135.7722992],
  [35.0089836, 135.7712531], // 三条大橋西詰
];
