/** 甲州街道初期ルートと品川道の重複区間のスポット一覧 */
const fuchuToTobitakyuSpots = [
  {
    name: "廃道迂回",
    coordinate: [35.665785, 139.509296],
    icon: "guide",
    description:
      "<span class='routing'>下諏訪方・府中方</span> 線路で道筋が分断されているため、この先の踏切を渡って" +
      "迂回します。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2026/07-18/IMG_20260718_124930.webp",
        comment: "西武多摩川線",
      },
    ],
  },
  {
    name: "庚申塔",
    kana: "こうしんとう",
    coordinate: [35.666072, 139.508353],
    icon: "monument",
    description:
      "左側面に道標のある庚申塔があります。「西 府中道」「東 品川道」「上 車返村」と彫られているように読めます。" +
      "右側面は上部が欠けていますが「？永六丑年四月吉日」「？和三年３月改造」と彫られているように読めます。" +
      "複数の可能性がありますが、仮に嘉永6年 (1853) だとするとペリー来航の年になります。" +
      "すぐ近くに品川道の案内標柱があります。<br/>" +
      "<span class='routing'>下諏訪方・府中方</span> 左折し街道筋に復帰します。<br/>" +
      "<span class='routing'>江戸方・品川方</span> 道筋が線路で分断されているため、右折し踏切で迂回します。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2026/07-18/IMG_20260718_125238.webp",
        comment: "庚申塔",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2026/07-18/IMG_20260718_125303.webp",
        comment: "左側面",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2026/07-18/IMG_20260718_125311.webp",
        comment: "右側面",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2026/07-18/IMG_20260718_125343.webp",
        comment: "品川道 案内標柱",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2026/07-18/IMG_20260718_125408.webp",
        comment: "品川道 案内図",
      },
    ],
  },
  {
    name: "道標",
    kana: "みちしるべ",
    coordinate: [35.666306, 139.507518],
    icon: "monument",
    description:
      "交差点の一角に寿司屋の看板と一体になった新し`い道標があります。" +
      "道標は正面に「左 五宿」「右 不ち由宇」(府中)、右側面に「右 以奈記」(稲城) と彫られているように見えます。" +
      "対面には古そうな石造物がありますが、判読不能です。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2026/07-18/IMG_20260718_125548.webp",
        comment: "道標",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2026/07-18/IMG_20260718_125537.webp",
        comment: "古そうな石造物",
      },
    ],
  },
  {
    name: "常久一里塚跡",
    kana: "つねひさいちりづかあと",
    coordinate: [35.667733, 139.500673],
    icon: "ichirizuka",
    description:
      "日本橋から7里 (約27.5km) の一里塚跡で、大きな石碑と説明板があります。" +
      "江戸初期に整備された初期の甲州街道の道筋上にあり、付け替え後は府中から東海道の品川宿に至る品川道の道筋の" +
      "一部となりました。" +
      "令和8年 (2026) 2月に説明板が更新され、説明板の下にあった武蔵名勝図絵は撤去されましたが、説明板自体の内容は" +
      "強化されました。",
    url: "https://www.kankou-fuchu.com/?p=we-page-entry&spot=40311",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2026/07-18/IMG_20260718_130402.webp",
        comment: "常久一里塚跡",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2026/07-18/IMG_20260718_130408.webp",
        comment: "説明板",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2025/02-22/PXL_20250222_040820853.webp",
        comment: "旧説明板 (令和8年更新前)",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2025/02-22/PXL_20250222_040824436.webp",
        comment: "武蔵名勝図絵 (撤去済)",
      },
    ],
  },
];

/** 甲州街道初期ルートと品川道の重複区間のルート */
const fuchuToTobitakyuRoute = [
  [35.6625744, 139.520461], // 品川道・甲州街道初期ルート分岐
  [35.6627357, 139.5200586],
  [35.6631062, 139.5189643],
  [35.6634069, 139.5179397],
  [35.6636205, 139.5171243],
  [35.6638602, 139.5162767],
  [35.6641042, 139.5155632],
  [35.6643744, 139.5144796],
  [35.664697, 139.5134228],
  [35.6650238, 139.5122963],
  [35.6652853, 139.5112234],
  [35.6654727, 139.5105958],
  [35.6657691, 139.5094746],
  [35.6657604, 139.509142],
  [35.6654771, 139.508611],
  [35.6657081, 139.5084178],
  [35.6660306, 139.5083749],
  [35.6661526, 139.5079619],
  [35.6662964, 139.5077044],
  [35.6664403, 139.507125],
  [35.6664925, 139.5067656],
  [35.6668499, 139.5053494],
  [35.6669937, 139.5048988],
  [35.6671419, 139.5045072],
  [35.6674208, 139.5027477],
  [35.6675821, 139.5016748],
  [35.6677738, 139.5006663],
  [35.6679046, 139.4998509],
  [35.6682097, 139.4979948],
  [35.6682968, 139.497512], // 品川道・甲州街道初期ルート分岐
  /*
  [35.6684711, 139.4966805],
  [35.6687718, 139.4958222],
  [35.669042, 139.4954091],
  [35.6694212, 139.4951409], // 東府中駅前
  */
];
