/** 中山道と川越街道の共通分のスポット一覧 */
const nihonbashiToHiraoSpots = [
  {
    name: "今川橋",
    coordinate: [35.690036, 139.772243],
    icon: "bridge",
    description:
      "今川焼発祥の地で、元祖ではありませんが今川焼を売るお店があります。" +
      "名前の由来になった橋はもうありませんが、交差点の名前として残っています。" +
      "なお、近くにある由来碑によると、名主である今川氏の尽力により架けられた橋なので今川橋となったそうです。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2025/05-05/IMG_20250505_084052.webp",
        comment: "今川橋交差点",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2025/05-05/IMG_20250505_084002.webp",
        comment: "今川焼本舗",
      },
    ],
  },
  {
    name: "神田明神",
    kana: "かんだみょうじん",
    coordinate: [35.701894, 139.76782],
    icon: "shrine",
    description:
      "江戸総鎮守として崇敬を集めてきた神社で、日本橋や秋葉原など周辺各地を多数の山車が巡行する神田祭でも有名です。",
    url: "https://www.kandamyoujin.or.jp",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2025/05-05/IMG_20250505_090516.webp",
        comment: "社殿",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2025/05-05/IMG_20250505_090414.webp",
        comment: "随神門",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2025/05-05/IMG_20250505_090121.webp",
        comment: "鳥居",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2025/05-05/IMG_20250505_091027.webp",
        comment: "御神馬 明 (あかり)",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2025/05-05/IMG_20250505_091138.webp",
        comment: "神田明神資料館",
      },
    ],
  },
  {
    name: "赤門",
    kana: "あかもん",
    coordinate: [35.710621, 139.760301],
    icon: "monument",
    description:
      "国指定重要文化財。文政10年 (1827) に加賀藩前田家の姫専用門として建てられたもので、" +
      "その後東大の門になりました。" +
      "2021年の耐震診断で問題が見つかり門は閉鎖、2027年までに補修予定とのことです。",
    url: "https://treasure.adm.u-tokyo.ac.jp/akamon",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2025/05-05/IMG_20250505_102907.webp",
        comment: "赤門",
      },
    ],
  },
  {
    name: "追分一里塚跡",
    kana: "おいわけいちりづかあと",
    coordinate: [35.7160864, 139.7584158],
    icon: "ichirizuka",
    description:
      "日本橋から1里 (約3.9km) の一里塚跡で、説明板があります。" +
      "ここは中山道と日光御成道 (旧岩槻街道) の追分 (分かれ道) にあたるため、追分一里塚と呼ばれててきたそうです。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2025/05-05/IMG_20250505_105013.webp",
        comment: "説明板",
      },
    ],
  },
  {
    name: "徳川慶喜巣鴨屋敷跡地",
    coordinate: [35.732354, 139.739672],
    icon: "monument",
    description:
      "最後の将軍徳川慶喜が大政奉還後の明治30年 (1897) から4年間ここに屋敷を構えていたとのことです。" +
      "しかし現在の山手線が屋敷のすぐ横を通ることになり、騒音を嫌ってこの地を離れたそうです。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2022/12-04/IMG_20221204_072034.webp",
        comment: "石碑・説明板",
      },
    ],
  },
  {
    name: "とげぬき地蔵尊 (高岩寺)",
    kana: "とげぬきじぞうそん (こうがんじ)",
    coordinate: [35.735724, 139.73542],
    icon: "temple",
    description:
      "曹洞宗のお寺で、商店街 (巣鴨地蔵通り) の名前にもなっています。" +
      "地蔵菩薩のお告げを受けた武士が地蔵の姿を封じた紙 (御影) を川に流したところ病に苦しむ妻が回復したとの言い伝えがあり、" +
      "さらにその後、針を誤飲してしまった女が御影を飲み込んだところ針を吐き出すことができたとの言い伝えが重なって" +
      "「とげぬき地蔵尊」と言われるようになったそうです。",
    url: "https://togenuki.jp",
  },
  {
    name: "板橋平尾宿",
    kana: "いたばしひらおしゅく",
    coordinate: [35.747971, 139.717739],
    icon: "monument",
    description:
      "板橋宿は上宿・仲宿・平尾宿 (下宿) の3つの宿場で構成されており、このあたりが平尾宿のようです。" +
      "説明板があり、駕籠や馬借、荷駄、飛脚 (問屋場) があったと記されています。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2025/05-05/IMG_20250505_130547.webp",
        comment: "ここは板橋平尾宿",
      },
    ],
  },
  // 1. 板橋宿
  {
    name: "平尾追分",
    coordinate: [35.7496208, 139.7141165],
    icon: "guide",
    description:
      "中山道と川越街道の追分 (分かれ道) です。" +
      "中山道はここから北西方向に伸びており、ここから板橋宿の仲宿エリアになります。" +
      "川越街道はここから西方、四ツ又を経由し大山駅へと進みます。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2022/12-04/IMG_20221204_080216.webp",
        comment: "平尾追分",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2022/12-04/IMG_20221204_080408.webp",
        comment: "観明寺の前に立つ「板橋宿今昔みちしるべ」案内板",
      },
    ],
  },
];

/** 中山道と川越街道の共通分のおすすめ歩行ルート */
const nihonbashiToHiraoRoute = [
  [35.684112, 139.774533], // 日本橋
  [35.684573, 139.774619],
  [35.695184, 139.770261],
  [35.695342, 139.770142],
  [35.69739, 139.769472],
  [35.698106, 139.768708],
  [35.698725, 139.768966],
  [35.699131, 139.768199],
  [35.699841, 139.76843],
  [35.700976, 139.766943],
  [35.701328, 139.766981],
  [35.701808, 139.766187],
  [35.701492, 139.766047],
  [35.704352, 139.761653],
  [35.704849, 139.761203],
  [35.705667, 139.760827],
  [35.709616, 139.760272],
  [35.716015, 139.758586], // 本郷追分
  [35.716, 139.757743],
  [35.716147, 139.757474],
  [35.718565, 139.755046],
  [35.719458, 139.754387],
  [35.723682, 139.752071],
  [35.724448, 139.750638],
  [35.725951, 139.748021],
  [35.728639, 139.743879],
  [35.731604, 139.740857],
  [35.734553, 139.737257], // 巣鴨駅
  [35.734812, 139.736546],
  [35.735362, 139.735486],
  [35.735782, 139.734785],
  [35.738025, 139.731557],
  [35.738116, 139.731433],
  [35.739987, 139.729345],
  [35.742264, 139.726369],
  [35.745697, 139.722197],
  [35.746241, 139.721325],
  [35.749664, 139.71416], // 平尾追分
];
